<?php
/**
 * Created by PhpStorm.
 * User: karellen
 * Date: 4/19/17
 * Time: 10:37 PM
 */
session_start();

$app_name       = 'Автодискаунтер';
$to         = '0790621@mail.ru';
$subject    = 'Новый заказ!';
$subject2   = 'Клиент просит перезвонить!';

//$headers = "From: " . strip_tags($_POST['req-email']) . "\r\n";
//$headers .= "Reply-To: ". strip_tags($_POST['req-email']) . "\r\n";
$headers .= "MIME-Version: 1.0\r\n";
$headers .= "Content-Type: text/html; charset=UTF-8\r\n";

$fields = [
    "car_brand"     => [
        "title"         => "Марка автомобиля",
        "rule"          => "/^.{0,100}$/",

    ],
    "name"          => [
        "title"         => "Имя",
        "rule"          => "/^\D{0,100}$/",
    ],
    "phone"         => [
        "title"         => "Телефон",
        "rule"          => "/^\d{10}$/",
    ],
    "email"         => [
        "title"         => "E-mail",
        "rule"          => "/(^$|^(?!(?:(?:\\x22?\\x5C[\\x00-\\x7E]\\x22?)|(?:\\x22?[^\\x5C\\x22]\\x22?)){255,})(?!(?:(?:\\x22?\\x5C[\\x00-\\x7E]\\x22?)|(?:\\x22?[^\\x5C\\x22]\\x22?)){65,}@)(?:(?:[\\x21\\x23-\\x27\\x2A\\x2B\\x2D\\x2F-\\x39\\x3D\\x3F\\x5E-\\x7E]+)|(?:\\x22(?:[\\x01-\\x08\\x0B\\x0C\\x0E-\\x1F\\x21\\x23-\\x5B\\x5D-\\x7F]|(?:\\x5C[\\x00-\\x7F]))*\\x22))(?:\\.(?:(?:[\\x21\\x23-\\x27\\x2A\\x2B\\x2D\\x2F-\\x39\\x3D\\x3F\\x5E-\\x7E]+)|(?:\\x22(?:[\\x01-\\x08\\x0B\\x0C\\x0E-\\x1F\\x21\\x23-\\x5B\\x5D-\\x7F]|(?:\\x5C[\\x00-\\x7F]))*\\x22)))*@(?:(?:(?!.*[^.]{64,})(?:(?:(?:xn--)?[a-z0-9]+(?:-+[a-z0-9]+)*\\.){1,126}){1,}(?:(?:[a-z][a-z0-9]*)|(?:(?:xn--)[a-z0-9]+))(?:-+[a-z0-9]+)*)|(?:\\[(?:(?:IPv6:(?:(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){7})|(?:(?!(?:.*[a-f0-9][:\\]]){7,})(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,5})?::(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,5})?)))|(?:(?:IPv6:(?:(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){5}:)|(?:(?!(?:.*[a-f0-9]:){5,})(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,3})?::(?:[a-f0-9]{1,4}(?::[a-f0-9]{1,4}){0,3}:)?)))?(?:(?:25[0-5])|(?:2[0-4][0-9])|(?:1[0-9]{2})|(?:[1-9]?[0-9]))(?:\\.(?:(?:25[0-5])|(?:2[0-4][0-9])|(?:1[0-9]{2})|(?:[1-9]?[0-9]))){3}))\\]))$)/iD",
    ],
    "new"           => [
        "title"         => "Нужны новые",
        "rule"          => "/^[0-1]$/",
    ],
    "old"           => [
        "title"         => "Нужны б/у",
        "rule"          => "/^[0-1]$/",
    ],
    "participant"   => [
        "title"         => "Участник группы ВК",
        "rule"          => "/^[0-1]$/",
    ],
    "car_model"     => [
        "title"         => "Модель",
        "rule"          => "/^.{0,100}$/"
    ],
    "car_year"      => [
        "title"         => "Год выпуска",
        "rule"          => "/(^$|^\d{4}$)/",
    ],
    "car_vin"       => [
        "title"         => "VIN",
        "rule"          => "/^.{0,17}$/",
    ],
    "description"   => [
        "title"         => "Дополнительно",
        "rule"          => "/^.{0,511}$/s",
    ],
];